Tekla Open API Reference for Tekla Structures 2025
RebarEndDetailModifier.RebarThreading Property
 Gets or sets the reinforcing bar threading data.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarThreadingDataNullable RebarThreading { get; set; }
Public Property RebarThreading As RebarThreadingDataNullable
	Get
	Set
Property Value
Type: RebarThreadingDataNullable
See Also
Reference
RebarEndDetailModifier Class
Tekla.Structures.Model Namespace